---
kind: method
id: M:Autodesk.Revit.DB.StdPostedWarning.Dispose
source: html/e8dea879-6c18-6765-3d97-b197c831e2b2.htm
---
# Autodesk.Revit.DB.StdPostedWarning.Dispose Method

Releases all resources used by the StdPostedWarning

## Syntax (C#)
```csharp
public void Dispose()
```